In [90]:
import pandas as pd

In [91]:
data = pd.read_html('https://www.officialcharts.com/chart-news/the-best-selling-albums-of-all-time-on-the-official-uk-chart__15551/', header=0)

In [92]:
df = data[0]

In [93]:
df.head()

   POS                                 TITLE   ARTIST  YEAR  HIGH POSN
0    1                         GREATEST HITS    QUEEN  1981          1
1    2                  GOLD - GREATEST HITS     ABBA  1992          1
2    3  SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967          1
3    4                                    21    ADELE  2011          1
4    5        WHAT'S THE STORY MORNING GLORY    OASIS  1995          1

### Change columns name

In [94]:
df.rename(columns={'POS': 'POZ', 'TITLE': 'TYTUŁ', 'ARTIST': 'ARTYSTA', 'YEAR': 'ROK', 'HIGH POSN': 'MAX POZ'}, inplace=True)

### Number of artists in the album

In [95]:
df['ARTYSTA'].nunique()

47

### Which artists are most often on the list - Top 5

In [96]:
df['ARTYSTA'].value_counts().head(5)

COLDPLAY         3
TAKE THAT        3
FLEETWOOD MAC    2
ABBA             2
DIDO             2
Name: ARTYSTA, dtype: int64

### Change columns headings

In [99]:
df.rename(str.capitalize, axis=1, inplace=True)
df.head()

   Poz                                 Tytuł  Artysta   Rok  Max poz
0    1                         GREATEST HITS    QUEEN  1981        1
1    2                  GOLD - GREATEST HITS     ABBA  1992        1
2    3  SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967        1
3    4                                    21    ADELE  2011        1
4    5        WHAT'S THE STORY MORNING GLORY    OASIS  1995        1

### Drop 'Max poz' column

In [100]:
df.drop('Max poz', axis=1, inplace=True)

### Years with most number of albums

In [101]:
df.set_index('Rok', inplace=True)
df.groupby(by='Tytuł', level='Rok').count().sort_values(by='Tytuł', ascending=False).head()

      Poz  Tytuł  Artysta
Rok
2000    4      4        4
1987    4      4        4
1998    3      3        3
2006    3      3        3
1997    3      3        3